#Индекс участника с минимальным баллом
def indexMin(a):
    k = -1
    indMin = 0
    while k != min(a):
        k = a[indMin]
        indMin += 1
    return(indMin)

#Ввод парных сравнений
def parnSravn(a, b):
    k = 0
    for x in b:
        if x != min(b):
            ss = input("Введите оценку при сравнении с худшим результатом: ")
            a.append(int(ss))
        else:
            print("Значение равно 1")
            a.append(1)
            
#Матрица 
def matrix(a, b, A):
    for i in range(7):
        A.append([0] * 7)

    for i in range(7):
        for j in range(7):
            if i == j:
                A[i][j] = 1.00
                continue

            if (j == indexMin(a) - 1) and (i != indexMin(a) - 1):
                A[i][j] = float("%.2f" % b[i])
                A[j][i] = "%.2f" % (1.00 / b[i])
    for i in range(7):
        for j in range(7):
            if (i == j) or (A[i][j] != 0):
                print(A[i][j], end = "      ")
                continue
            A[i][j] = "%.2f" % (float(A[indexMin(a)-1][j]) / float(A[indexMin(a)-1][i]))
            print(A[i][j], end = "      ")
        print()
    return(A)

def cMnog(A, c1, c2, c3, c4, c5, c6, c7):
    for i in range(7):
        c1 = c1 + float(A[i][0])
        c2 = c2 + float(A[i][1])
        c3 = c3 + float(A[i][2])
        c4 = c4 + float(A[i][3])
        c5 = c5 + float(A[i][4])
        c6 = c6 + float(A[i][5])
        c7 = c7 + float(A[i][6])
    return(float("%.2f" % (1 / c1)), float("%.2f" % (1 / c2)), float("%.2f" % (1 / c3)), float("%.2f" % (1 / c4)), float("%.2f" % (1 / c5)), float("%.2f" % (1 / c6)), float("%.2f" % (1 / c7)))


# 1 Критерий Скорость

print("Введите результаты спортсменов по критерию Скорость:")
print()
x1 = int(input("Какие баллы были набраны первым участником? "))
x2 = int(input("Какие баллы были набраны вторым участником? "))
x3 = int(input("Какие баллы были набраны третьим участником? "))
x4 = int(input("Какие баллы были набраны четвертым участником? "))
x5 = int(input("Какие баллы были набраны пятым участником? "))
x6 = int(input("Какие баллы были набраны шестым участником? "))
x7 = int(input("Какие баллы были набраны седьмым участником? "))

print("Текущие баллы спортсменов по критерию Скорость: ", x1, x2, x3, x4, x5, x6, x7)

#Баллы
XMK = [x1, x2, x3, x4, x5, x6, x7]

print("Наихудший результат =", min(XMK))
print()
print("Введите парное сравнение по шкале Саати относительно с участником ", indexMin(XMK))

MK = []
parnSravn(MK, XMK)
print("Получившиеся оценки: ", MK)
print()

print("Матрица парных сравнений принимает вид: ")
A1 = []
matrix(XMK, MK, A1)
print()

# 2 Критерий Гибкость
print("Введите результаты спортсменов по критерию Гибкость:")
print()
y1 = int(input("Какие баллы были набраны первым участником? "))
y2 = int(input("Какие баллы были набраны вторым участником?  "))
y3 = int(input("Какие баллы были набраны третьим участником? "))
y4 = int(input("Какие баллы были набраны четвертым участником? "))
y5 = int(input("Какие баллы были набраны пятым участником? "))
y6 = int(input("Какие баллы были набраны шестым участником? "))
y7 = int(input("Какие баллы были набраны седьмым участником? "))

print("Текущие баллы спортсменов по критерию Гибкость: ", y1, y2, y3, y4, y5, y6, y7)

YP = [y1, y2, y3, y4, y5, y6, y7]
print("Наихудший результат =", min(YP))
print()

print("Введите парное сравнение по шкале Саати относительно с участником ", indexMin(YP))

P = []
parnSravn(P, YP)
print("Получившиеся оценки: ", P)
print()

print("Матрица парных сравнений принимает вид: ")
A2 = []
matrix(YP, P, A2)
print()

# 3 Критерий Музыка
print("Введите результаты спортсменов по критерию Музыка:")
print()
z1 = int(input("Какие баллы были набраны первым участником? "))
z2 = int(input("Какие баллы были набраны вторым участником? "))
z3 = int(input("Какие баллы были набраны третьим участником? "))
z4 = int(input("Какие баллы были набраны четвертым участником? "))
z5 = int(input("Какие баллы были набраны пятым участником? "))
z6 = int(input("Какие баллы были набраны шестым участником? "))
z7 = int(input("Какие баллы были набраны седьмым участником? "))

print("Текущие баллы спортсменов по критерию Музыка: ", z1, z2, z3, z4, z5, z6, z7)

ZI = [z1, z2, z3, z4, z5, z6, z7]
print("Наихудший результат =", min(ZI))
print()

print("Введите парное сравнение по шкале Саати относительно с участником ", indexMin(ZI))

I = []
parnSravn(I, ZI)
print("Получившиеся оценки: ", I)
print()

print("Матрица парных сравнений принимает вид: ")
A3 = []
matrix(ZI, I, A3)
print()

# 4 Критерий Техникчность исполнения
print("Введите результаты спортсменов по критерию Техникчность исполнения:")
print()
r1 = int(input("Какие баллы были набраны первым участником? "))
r2 = int(input("Какие баллы были набраны вторым участником? "))
r3 = int(input("Какие баллы были набраны третьим участником? "))
r4 = int(input("Какие баллы были набраны четвертым участником? "))
r5 = int(input("Какие баллы были набраны пятым участником? "))
r6 = int(input("Какие баллы были набраны шестым участником? "))
r7 = int(input("Какие баллы были набраны седьмым участником? "))

print("Текущие баллы спортсменов по критерию Техничность исполнения: ", z1, z2, z3, z4, z5, z6, z7)

RG = [r1, r2, r3, r4, r5, r6, r7]
print("Наихудший результат =", min(RG))
print()

print("Введите парное сравнение по шкале Саати относительно с участником ", indexMin(RG))

G = []
parnSravn(G, RG)
print("Получившиеся оценки: ", G)
print()

print("Матрица парных сравнений принимает вид: ")
A4 = []
matrix(RG, G, A4)
print()

# 5 Критерий Мастерство
print("Введите результаты спортсменов по критерию Мастерство:")
print()
t1 = int(input("Какие баллы были набраны первым участником? "))
t2 = int(input("Какие баллы были набраны вторым участником? "))
t3 = int(input("Какие баллы были набраны третьим участником? "))
t4 = int(input("Какие баллы были набраны четвертым участником? "))
t5 = int(input("Какие баллы были набраны пятым участником? "))
t6 = int(input("Какие баллы были набраны шестым участником? "))
t7 = int(input("Какие баллы были набраны седьмым участником? "))

print("Текущие баллы спортсменов по критерию Мастерство: ", t1, t2, t3, t4, t5, t6, t7)

TR = [t1, t2, t3, t4, t5, t6, t7]
print("Наихудший результат =", min(TR))
print()

print("Введите парное сравнение по шкале Саати относительно с участником ", indexMin(TR))

U = []
parnSravn(U, TR)
print("Получившиеся оценки: ", U)
print()

print("Матрица парных сравнений принимает вид: ")
A5 = []
matrix(TR, U, A5)
print()

#Построение нечеткого множества
print("Таким образом, нечеткие множества, сопоставленные критериям имеют вид: ")
print()
cm1 = 0
cm2 = 0
cm3 = 0
cm4 = 0
cm5 = 0
cm6 = 0
cm7 = 0
cm1, cm2, cm3, cm4, cm5, cm6, cm7 = cMnog(A1, cm1, cm2, cm3, cm4, cm5, cm6, cm7)
print("Критерий Скорость: ", cm1, cm2, cm3, cm4, cm5, cm6, cm7)

cp1 = 0
cp2 = 0
cp3 = 0
cp4 = 0
cp5 = 0
cp6 = 0
cp7 = 0
cp1, cp2, cp3, cp4, cp5, cp6, cp7 = cMnog(A2, cp1, cp2, cp3, cp4, cp5, cp6, cp7)
print("Критерий Гибкость: ", cp1, cp2, cp3, cp4, cp5, cp6, cp7)

ci1 = 0
ci2 = 0
ci3 = 0
ci4 = 0
ci5 = 0
ci6 = 0
ci7 = 0
ci1, ci2, ci3, ci4, ci5, ci6, ci7 = cMnog(A3, ci1, ci2, ci3, ci4, ci5, ci6, ci7)
print("Критерий  Музыка: ", ci1, ci2, ci3, ci4, ci5, ci6, ci7)

cg1 = 0
cg2 = 0
cg3 = 0
cg4 = 0
cg5 = 0
cg6 = 0
cg7 = 0
cg1, cg2, cg3, cg4, cg5, cg6, cg7 = cMnog(A4, cg1, cg2, cg3, cg4, cg5, cg6, cg7)
print("Критерий Техникчность исполнения: ", cg1, cg2, cg3, cg4, cg5, cg6, cg7)

ct1 = 0
ct2 = 0
ct3 = 0
ct4 = 0
ct5 = 0
ct6 = 0
ct7 = 0
ct1, ct2, ct3, ct4, ct5, ct6, ct7 = cMnog(A5, ct1, ct2, ct3, ct4, ct5, ct6, ct7)
print("Критерий Мастерство: ", ct1, ct2, ct3, ct4, ct5, ct6, ct7)

print("Общее нечеткое множество: ", min(cm1, cp1, ci1, cg1, ct1), " ", min(cm2, cp2, ci2, cg2, ct2), " ", min(cm3, cp3, ci3, cg3, ct3), " ", min(cm4, cp4, ci4, cg4, ct4), " ", min(cm5, cp5, ci5, cg5, ct5), " ", min(cm6, cp6, ci6, cg6, ct6), " ", min(cm7, cp7, ci7, cg7, ct7))

print()
ravnKr = [min(cm1, cp1, ci1, cg1, ct1), min(cm2, cp2, ci2, cg2, ct2), min(cm3, cp3, ci3, cg3, ct3), min(cm4, cp4, ci4, cg4, ct4), min(cm5, cp5, ci5, cg5, ct5), min(cm6, cp6, ci6, cg6, ct6), min(cm7, cp7, ci7, cg7, ct7)]
print("Если критерии равновесные, то получились баллы: ")
print("Баллы спортсменов в порядке возрастания: ", sorted(ravnKr))

print()
print("Если критерии не равновесные:")
b1 = int(input(("Скорость относительно Музыка по шкале Саати: ")));
b2 = int(input(("Гибкость относительно Музыка по шкале Саати: ")));
b3 = int(input(("Техника исполнения относительно Музыка по шкале Саати: ")));
b4 = int(input(("Мастерство относительно Музыка по шкале Саати: ")));
print()
print("Матрица парных сравнений принимает вид: ")
B = []
for i in range(5):
        B.append([0] * 5)

for i in range(5):
    for j in range(5):
        B[0][0] = 1
        B[1][1] = 1
        B[2][2] = 1
        B[3][3] = 1
        B[4][4] = 1
        B[1][0] = 1.5
        B[2][0] = 0.25
        B[3][0] = 2
        B[4][0] = 2.25
        B[0][1] = 0.67 
        B[2][1] = 0.17
        B[3][1] = 1.33
        B[4][1] = 1.5
        B[0][2] = 4
        B[1][2] = 6
        B[3][2] = 8
        B[4][2] = 9
        B[0][3] = 0.5
        B[1][3] = 0.75
        B[2][3] = 0.13
        B[4][3] = 1.13
        B[0][4] = 0.33
        B[1][4] = 0.66
        B[2][4] = 0.1
        B[3][4] = 0.9
        
        print(B[i][j], end = "      ")
    print()

print()

bm = 1 / (B[0][0] + B[1][0] + B[2][0] + B[3][0] + B[4][0])
bp = 1 / (B[0][1] + B[1][1] + B[2][1] + B[3][1] + B[4][1])
bi = 1 / (B[0][2] + B[1][2] + B[2][2] + B[3][2] + B[4][2])
bt = 1 / (B[0][3] + B[1][3] + B[2][3] + B[3][3] + B[4][3])
bn = 1 / (B[0][4] + B[1][4] + B[2][4] + B[3][4] + B[4][4])
print("Значения степеней принадлежности критериев: ", float("%.2f" % bm), float("%.2f" % bp), float("%.2f" % bi), float("%.2f" % bt), float("%.2f" % bn))

ma = float("%.2f" % (min(cm1 ** bm , cp1 ** bp, ci1 ** bi, cg1 ** bt, ct1 ** bn)))
mb = float("%.2f" % (min(cm2 ** bm , cp2 ** bp, ci2 ** bi, cg2 ** bt, ct2 ** bn)))
mc = float("%.2f" % (min(cm3 ** bm , cp3 ** bp, ci3 ** bi, cg3 ** bt, ct3 ** bn)))
md = float("%.2f" % (min(cm4 ** bm , cp4 ** bp, ci4 ** bi, cg4 ** bt, ct4 ** bn)))
me = float("%.2f" % (min(cm5 ** bm , cp5 ** bp, ci5 ** bi, cg5 ** bt, ct5 ** bn)))
mf = float("%.2f" % (min(cm6 ** bm , cp6 ** bp, ci6 ** bi, cg6 ** bt, ct6 ** bn)))
mg = float("%.2f" % (min(cm7 ** bm , cp7 ** bp, ci7 ** bi, cg7 ** bt, ct7 ** bn)))

print("Общее нечеткое множество: ", ma, mb, mc, md, me, mf, mg)

sortB = [ma, mb, mc, md, me, mf, mg]
print("Список упорядочения баллов спортсменов: ", sorted(sortB))
